Revit 2027 API
IdlingEventArgs.SetRaiseWithoutDelay Method
 Sets the next invocation of the idling event to be called promptly, rather than relying on the default recurrence of idling from the Revit application. For more details see the remarks describing the Idling event.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRaiseWithoutDelay()
Public Sub SetRaiseWithoutDelay
public:
void SetRaiseWithoutDelay()
member SetRaiseWithoutDelay : unit -> unit
See Also
Reference
IdlingEventArgs Class
Autodesk.Revit.UI.Events Namespace